Repository: Ernazar02A/test1
Catalog: lib/localization/l10n/intl_*.arb
Languages: ky

# blankError
source: This field cannot be blank
ky: Бул талаа бош болбошу керек

# eightCharactersError
source: Password must be at least 8 characters
ky: Сырсөз кеминде 8 белгиден турушу керек

# oneSpecialError
source: Password must contain at least one special character
ky: Сырсөздө жок дегенде бир атайын белги болушу керек

# oneUppercaseError
source: Password must contain at least one uppercase letter
ky: Сырсөздө жок дегенде бир баш тамга болушу керек

# oneDigitError
source: Password must contain at least one digit
ky: Сырсөздө жок дегенде бир сан болушу керек

# mustNotContainEmailError
source: Password must not contain your email
ky: Сырсөздө сиздин email болбошу керек

# wrongPasswordError
source: Wrong password
ky: Туура эмес сырсөз

# notLikeOldPasswordError
source: New password must not be the same as the old password
ky: Жаңы сырсөз эскисине окшош болбошу керек

# invalidProviderError
source: Invalid provider
ky: Туура эмес провайдер

# userNotFoundError
source: User not found
ky: Колдонуучу табылган жок

# userAlreadyExistsError
source: User already exists
ky: Колдонуучу мурунтан бар

# invalidEmailError
source: Invalid email address
ky: Туура эмес email

# emailAlreadyExistError
source: Email already exists
ky: Email мурунтан бар

# phoneNumberAlreadyExistError
source: Phone number already exists
ky: Телефон номери мурунтан бар

# incorrectCodeError
source: Incorrect code
ky: Туура эмес код

# mismatchConfirmPassword
source: Not similar password
ky: Сыр сөздөр окшош эмес

# unknownError
source: Unknown error occurred
ky: Белгисиз ката кетти

# wrongPasswordOrLogin
source: Password is not valid
ky: Сырсөз туура эмес

# invalidPhoneError
source: Invalid number
ky: Номер туура эмес
